Revit 2027 API
MeshTriangle.Vertex Property
A vertex of the triangle.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ this[
	int idx
] { get; }
Public ReadOnly Property Vertex (
	idx As Integer
) As XYZ
	Get
public:
property XYZ^ Vertex[int idx] {
	XYZ^ get (int idx);
}
member Vertex : XYZ with get
Parameters
idx Int32
Index of the vertex in the triangle: 0, 1 or 2.
Property Value
XYZ
See Also
Reference
MeshTriangle Class
Autodesk.Revit.DB Namespace